{
  "elian": {
    "rootNode": {
      "character": "elian",
      "text": "Aurora! È passato un anno da quando la Dama Celeste ha sollevato il nostro villaggio con un esperimento scientifico fallito. Tuo fratello Leo e molti altri sono rimasti quaggiù.",
      "choices": [
        {
          "text": "Un esperimento scientifico? Cosa è successo esattamente?",
          "nextNode": {
            "character": "elian",
            "text": "La Dama Celeste, una scienziata brillante ma con una visione distorta, credeva di poter creare un'utopia. Il suo tentativo di purificare il mondo ha invece generato un'onda di energia che ha pietrificato alcuni e donato poteri elementali ad altri. I Fah e i Brih sono nati così.",
            "choices": [
              {
                "text": "Quindi i Fah e i Brih non sono creature magiche, ma umani con poteri?",
                "nextNode": {
                  "character": "elian",
                  "text": "Esatto. Hanno formato delle squadre, dei clan, per proteggersi e controllare i quartieri di questa nuova città. Leo si è unito a uno di loro, credendo nella loro causa. L'ultima volta che l'ho visto, era diretto verso la Torre dell'Acqua, un punto strategico per il controllo delle risorse.",
                  "choices": [
                    {
                      "text": "Devo raggiungerlo. Come posso affrontare questi Fah e Brih?",
                      "nextNode": {
                        "character": "elian",
                        "text": "Non tutti sono ostili. Dovrai guadagnarti il loro rispetto, sia con la forza che con l'ingegno. Ho preparato per te questo bracciale. Ti permetterà di manipolare le energie elementali Fah (rossa) e Brih (blu) e, con le giuste risorse, potrai creare strumenti e armi avanzate. È la scienza che ci salverà, Aurora.",
                        "choices": [
                          {
                            "text": "Insegnami a usare questa scienza. Partirò per la Torre dell'Acqua.",
                            "nextNode": {
                              "character": "elian",
                              "text": "Ottima scelta. Ricorda, la conoscenza è il tuo potere più grande. E non fidarti ciecamente di nessuno, nemmeno della Dama Celeste. La verità è più complessa di quanto sembri.",
                              "choices": [
                                {
                                  "text": "Grazie, Maestro Elian. Sarò prudente.",
                                  "nextNode": null
                                }
                              ]
                            }
                          }
                        ]
                      }
                    }
                  ]
                }
              }
            ]
          }
        }
      ]
    }
  },
  "nyx": {
    "rootNode": {
      "character": "nyx",
      "text": "Benvenuta al mio emporio, viaggiatrice. Non vedo facce nuove da molto tempo. Sono Nyx, e qui troverai strumenti e componenti per ogni tua esigenza scientifica e di combattimento.",
      "choices": [
        {
          "text": "Strumenti scientifici? Cosa intendi?",
          "nextNode": {
            "character": "nyx",
            "text": "Con le giuste risorse, puoi combinare questi componenti per creare armi elementali più potenti, gadget utili o persino potenziamenti per il tuo bracciale. È tutta questione di chimica e fisica applicata, ragazza.",
            "choices": [
              {
                "text": "Hai visto un ragazzo di nome Leo? È mio fratello.",
                "nextNode": {
                  "character": "nyx",
                  "text": "Leo? Certo, è passato di qui. Un tipo tosto, con un forte senso di giustizia. Cercava componenti rari per potenziare la sua squadra. Sembrava determinato a sfidare l'autorità della Dama Celeste.",
                  "choices": [
                    {
                      "text": "Sai dove posso trovarlo ora?",
                      "nextNode": {
                        "character": "nyx",
                        "text": "Si dirigeva verso la Torre dell'Acqua, ma prima ti consiglio di parlare con Vex e Grim. Sono i leader della squadra 'I Fulmini' e conducono un programma televisivo che svela i segreti della città. Hanno molte informazioni, ma non sono facili da convincere.",
                        "choices": [
                          {
                            "text": "Dove posso trovare Vex e Grim?",
                            "nextNode": {
                              "character": "nyx",
                              "text": "Nel grande edificio con l'antenna al centro della città, il loro studio televisivo. Ma ti avverto, non aiutano mai nessuno gratuitamente. Dovrai dimostrare il tuo valore o offrire qualcosa in cambio.",
                              "choices": [
                                {
                                  "text": "Capisco. Posso vedere cosa hai in vendita?",
                                  "nextNode": {
                                    "character": "nyx",
                                    "text": "Certo! Ecco la mia selezione di componenti rari e schemi di crafting.",
                                    "choices": [
                                      {
                                        "text": "Forse tornerò più tardi.",
                                        "nextNode": null
                                      }
                                    ]
                                  }
                                }
                              ]
                            }
                          }
                        ]
                      }
                    }
                  ]
                }
              }
            ]
          }
        }
      ]
    }
  }
}


,
  "kaito": {
    "rootNode": {
      "character": "kaito",
      "text": "Saluti, viaggiatrice! Sono Kaito, un ricercatore. Il mio laboratorio è il mondo intero, e la mia missione è riscoprire la scienza perduta. Hai per caso trovato qualche reperto interessante?",
      "choices": [
        {
          "text": "Cosa intendi per scienza perduta?",
          "nextNode": {
            "character": "kaito",
            "text": "Prima dell'esperimento della Dama Celeste, il mondo era pieno di meraviglie tecnologiche. Ora, dobbiamo ricostruire tutto, pezzo per pezzo, usando l'ingegno. Se trovi schemi o componenti antichi, portameli! Potremmo fare grandi scoperte insieme.",
            "choices": [
              {
                "text": "Ho bisogno di trovare mio fratello Leo. Sai qualcosa di lui?",
                "nextNode": {
                  "character": "kaito",
                  "text": "Leo? Ah, sì, il ragazzo con la cicatrice sull'occhio. L'ho visto dirigersi verso il Distretto Cremisi, la zona dei 'Ghost Wolves'. Sembrava molto determinato, ma anche un po'... ribelle. Fai attenzione, quella zona è sotto il controllo di Ryu.",
                  "choices": [
                    {
                      "text": "Chi è Ryu?",
                      "nextNode": {
                        "character": "kaito",
                        "text": "Ryu è il capo dei 'Ghost Wolves', una fazione che non si fida né della Dama Celeste né delle altre squadre. Sono forti, ma anche molto protettivi verso i loro. Se vuoi parlargli, dovrai dimostrare di non essere una minaccia.",
                        "choices": [
                          {
                            "text": "Grazie per l'informazione, Kaito.",
                            "nextNode": null
                          }
                        ]
                      }
                    }
                  ]
                }
              }
            ]
          }
        }
      ]
    }
  },
  "ryu": {
    "rootNode": {
      "character": "ryu",
      "text": "Chi sei e cosa vuoi nel mio territorio? Non tollero spie della Dama Celeste o di altre squadre qui. Parla chiaro.",
      "choices": [
        {
          "text": "Sono Aurora, cerco mio fratello Leo. Mi hanno detto che è qui.",
          "nextNode": {
            "character": "ryu",
            "text": "Leo è con noi. Ha scelto di combattere per la libertà, non per le regole della Dama Celeste. Se vuoi vederlo, devi dimostrare di essere degna della nostra fiducia. Non siamo un gioco, qui si lotta per la sopravvivenza.",
            "choices": [
              {
                "text": "Cosa devo fare per guadagnarmi la vostra fiducia?",
                "nextNode": {
                  "character": "ryu",
                  "text": "La Dama Celeste sta cercando di espandere il suo controllo. Abbiamo bisogno di sabotare una delle sue nuove torri di comunicazione nel Distretto Azzurro. Se ci aiuti, potrai parlare con Leo. Ma se fallisci... non aspettarti pietà.",
                  "choices": [
                    {
                      "text": "Accetto. Farò quello che serve.",
                      "nextNode": null
                    }
                  ]
                }
              }
            ]
          }
        }
      ]
    }
  },
  "professoressa_hana": {
    "rootNode": {
      "character": "professoressa_hana",
      "text": "Benvenuta nel mio umile rifugio, Aurora. Sono la Professoressa Hana. Ho sentito parlare di te, e della tua ricerca della verità. La scienza è una forza potente, ma deve essere usata con saggezza. Non come ha fatto la Dama Celeste.",
      "choices": [
        {
          "text": "Lei conosceva la Dama Celeste?",
          "nextNode": {
            "character": "professoressa_hana",
            "text": "Eravamo colleghe, un tempo. Credevamo entrambe nel progresso, ma le nostre visioni si sono scontrate. Lei cercava il controllo, io la comprensione. L'esperimento che ha sollevato Altavista... è stato un errore tragico, di cui mi sento ancora responsabile.",
            "choices": [
              {
                "text": "C'è un modo per rimediare? Per invertire la pietrificazione?",
                "nextNode": {
                  "character": "professoressa_hana",
                  "text": "Forse. La Dama Celeste possiede ancora la chiave, una tecnologia che potrebbe invertire il processo. Ma non la userà per il bene comune. Dobbiamo trovare un modo per accedere a quella conoscenza, ma senza ripetere gli errori del passato. È una questione di etica, Aurora.",
                  "choices": [
                    {
                      "text": "Sono pronta ad affrontare questa sfida.",
                      "nextNode": null
                    }
                  ]
                }
              }
            ]
          }
        }
      ]
    }
  }
}
